posty/app/Http/Controllers/PostController.php

    public function index(){
        $posts = Post::latest()->with(['user', 'likes'])->paginate(2);
---
select * from `likes` where `likes`.`post_id` in (238, 239)
select * from `posts` order by `created_at` desc limit 2 offset 0
select * from `users` where `users`.`id` in (11, 12)
select count(*) as aggregate from `posts`

    public function destroy(Post $post){
       $this->authorize('delete', $post);
        $post->delete();
---
delete from `posts` where `id` = 244